print('=== Три поездки Ильи Муромца ===\n')
print('Стоит Илья перед камнем, а нем начертано: ')
print('\n\tНаправо ехати - женату быти.')
print('\n\tНалево ехати - богати быти.')
print('\n\tПрямо ехати - живу не бывати - нет пути ни прохожему, ни проезжему, ни пролетному...\n')
path = input('Куда поедет Илья Муромец? Ответьте прямо, направо или налево? ').strip().upper()

if path in ['НАПРАВО', 'ПРАВО', "СПРАВА", "RIGHT"]:
    print('\nПускал Илья коня направо...')
    print('\nЧто случилось: там его встретила богатырка-поляница. Она заманила его в терем и попыталась сбросить в глубокую хитроумную кровать-погреб с шипами и провалами.')
    print('\nЧем закончилось: Илья перехитрил девицу, бросил её в этот погреб, освободил из неволи томившихся там богатырей или царей, а саму хозяйку казнил. После этого он стер надпись на камне и написал: «женатым не бывал».')

elif path in ['НАЛЕВО', 'ЛЕВО', 'СЛЕВА', 'LEFT']:
    print('\nПускал Илья коня налево...')
    print("\nЧто случилось: обнаружил погреба с несметными богатствами: золотом, серебром и драгоценными камнями.")
    print("\nЧем закончилось: Богатырь не взял золото себе. Он построил на эти деньги церкви в Киеве, а остальное раздал бедным, сиротам и вдовам. На камне он оставил новую запись: «богат не бывал».")

elif path in ["ПРЯМО", 'ВПЕРЕД', 'ВПЕРЁД', "STRAIGHT"]:
    print('\nПовел Илья коня прямо...')
    print('\nЧто случилось: встретил Илья сорок сотен разбойников возле Смоленских грязей.')
    print('\nЧем закончилось: Богатырь разгромил их своим тяжелым шеломом, отказался становиться их атаманом, разогнал остатки и исправил надпись на камне: «убит не был».')

else:
    print("\nСтоит Илья, думу думает, коня не пускает...")
    print("Последствие: так и остался у камня - ни женатым, ни богатым, ни живым, ни мёртвым.")